Revit 2024 API
MEPSystemType.SystemClassification Property
 Identifies the classification for the system type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public MEPSystemClassification SystemClassification { get; }
Visual Basic
Public ReadOnly Property SystemClassification As MEPSystemClassification
	Get
Visual C++
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
}
Remarks
 The system classification drives certain behavior such as sizing and connections to other systems
See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace